[
    {
      "id": "1",
      "title": "French Toast",
      "category": "",
      "ingredients": [
          "6 large eggs",
          "1 1/2 cups heavy cream, half-and-half, or milk",
          "2 tablespoons pure vanilla extract",
          "1/2 teaspoons ground cinnamon",
          "Pinch of ground nutmeg",
          "Pinch of salt",
          "6 slices bread",
          "4 tablespoons unsalted butter",
          "4 tablespoons vegitable oil",
          "Your choice of syrup"
          ],
      "instructions":[
        "Preheat oven to 250°F. Place a wire rack on a baking sheet, and set aside.",
        "Whisk together eggs, cream, vanilla, cinnamon, nutmeg, and salt in a medium bowl; set aside.",
        "Place bread in a shallow baking dish large enough to hold bread slices in a single layer.",
        "Pour egg mixture over bread; soak 10 minutes. Turn slices over; soak until soaked through, about 10 minutes more.",
        "Heat 2 tablespoons butter and 2 tablespoons vegetable oil in a skillet over medium heat. Fry half the bread slices until golden brown, 2 to 3 minutes per side. Transfer to wire rack and place in preheated oven while cooking remaining French Toast.",
        "Wipe skillet, and repeat with remaining butter, oil, and bread.",
        "Serve warm with pure maple syrup, if desired."
          ],
      "notes": "You can substitute the vegitable oil with butter.",
      "source": "Martha Stewart's Kitchen",
      "user id": ""
    
    },
    {
      "id": "2",
      "title": "Southern Collard Greens ",
      "category": "",
      "ingredients": [
        "8 slices bacon chopped",
        "1 medium onion finely chopped",
        "3 cloves garlic",
        "1 lb collard greens washed trimmed, and cut",
        "3 cups chicken broth enough to cover the greens",
        "1 1/2 teaspoons apple cider vinegar",
        "1 tablespoon sugar",
        "½ teaspoon cajun seasoning",
        "¼ teaspoon smoked paprika",
        "¼ teaspoon crushed red pepper",
        "Salt and pepper to taste"
      ],
      "instructions": [
        "In a large Dutch oven or pan over medium heat, brown the bacon.",
        "When the bacon is about halfway browned add the chopped onion.",
        "Cook until the bacon is browned and the onion is soft. ",
        "Add the garlic and cook for 1 minute, stirring constantly.",
        "Serve warm with pure maple syrup, if desired.",  
        "Add the collard greens and cook until wilted and slightly softened.",   
        "Add the chicken broth, apple cider vinegar, sugar, Cajun seasoning, paprika, and crushed red pepper.", 
        "Cover and simmer for 45-60 minutes, letting the liquid cook down and the greens really soften.", 
        "Drain most of the liquid or use a slotted spoon to remove it.", 
        "Salt and pepper to taste."   
      ],
      "notes": "Bacon is easier to chop when frozen or partially frozen. When picking the greens, look for dark green leaves that are not wilted and blemish free. Store leftovers in an airtight container in the refrigerator for up to 3 days.",
      "source": "Mom's Recipe",
      "user id": ""

    },
    {
      "id": "3",
      "title": "Chickpea, Avocado and Feta Salad",
      "category": "",
      "ingredients": [
       "1 can Chickpeas Rinsed and Drained", 
       "2 whole Avocados",
       "1/3 cup Chopped Parsley",
       "2 TBSP Green Onion Thinly Sliced",
       "1/3 cup Feta Cheese",
       "1 whole Lime Juice (Squeezed)",
       "Salt and Pepper to Taste"
      ],
      "instructions": [
        "Combine all the ingredients in a large bowl and stir gently to combine, making sure not to mash the avocadoes and feta.",
        "Season with salt and pepper to taste."
      ],
      "notes": "",
      "source": "Pinterest",
      "user id": ""

    },
    {
      "id": "4",
      "title": "Cheesy Chorizo Dip",
      "category": "",
      "ingredients": [
        "1 teaspoon olive oil",
        "1 pound chorizo, casings removed",
        "5 slices of thick bacon, diced",
        "1 small onion, finely chopped",
        "2 cloves garlic, minced",
        "1 tablespoon sherry vinegar",
        "1 teaspoon smoked paprika",
        "1 14- ounce can fire roasted tomatoes",
        "1/3 cup chopped parsley",
        "1 pound cream cheese, 2 8oz packages, softened",
        "Salt and freshly ground black pepper, to taste",
        "4 ounces Manchego cheese, grated",
        "8 ounces Mozarella cheese, grated",
        "Optional: chives for garnishing"
      ],
      "instructions": [
        "Preheat oven to 400 degrees F.",
        "Heat the oil in a large skillet, over medium-high heat, until shimmering. Add the chorizo and cook, breaking it apart into smaller pieces with a wooden spoon, until browned, about 5-6 minutes. Remove with a slotted spoon and reserve.",
        "Drain most of the chorizo fat from the skillet and return the skillet to the heat. Add the bacon and cook until golden brown, around 5 minutes. Remove with a slotted spoon and reserve with the chorizo.",
        "Lower the heat to medium. Drain most of the fat again, leaving just a tablespoon or so in the skillet. Add the onion and garlic and sauté until softened and fragrant, 2-3 minutes. Add the sherry vinegar and paprika, stirring with a wooden spoon to deglaze the pan.",
        "Add the bacon and chorizo back to the pan. Then, add the fire roasted tomatoes and mix to combine. Cook for a couple of minutes so all the liquid evaporates.",
        "Remove the skillet from the heat and stir in the chopped parsley.",
        "Add the softened cream cheese and stir until the cream cheese is melted and incorporated. Taste and season with salt and pepper.",
        "Combine both cheeses in a bowl. Add 2/3 to the skillet, mixing to combine.",
        "Transfer the dip to an oven safe dish and place on a baking sheet. Top with the remaining cheese and bake for 30 minutes or until the dip is heated through and the cheese has melted.",
        "Garnish with chopped chives and serve immediately."
      ],
      "notes": "You can substitute the Manchego cheese with Asiago, Parmesan or Pecorino instead. You can substitute the Chorizo with mild or hot Italian sausage",
      "source": "oliviascuisine.com",
      "user id": ""

    },
    {
      "id": "5",
      "title": "Slow Cooker Pulled Pork",
      "category": "",
      "ingredients": [
        "1 small yellow onion finely chopped",
        "6 ounces tomato paste",
        "1/3 cup apple cider vinegar",
        "1/3 cup honey",
        "1/4 cup water",
        "2 tablespoons brown sugar",
        "2 tablespoons Worcestershire sauce",
        "2 teaspoons smoked paprika",
        "2 teaspoons garlic powder",
        "2 teaspoons mustard powder",
        "2 teaspoons Sriracha or hot sauce of choice",
        "1 teaspoon kosher salt plus additional for the pork",
        "1 teaspoon liquid smoke optional but super good",
        "1 (3- to 4-pound) boneless pork shoulder or pork butt",
        "Ground black pepper",
        "2 tablespoons cornstarch plus 3 tablespoons cold water to create a slurry"
      ],
      "instructions": [
        "In the bottom of a 6-quart or larger slow cooker, whisk together the onion, tomato paste, apple cider vinegar, honey, water, brown sugar, Worcestershire, smoked paprika, garlic powder, mustard powder, sriracha, 1 teaspoon salt, and liquid smoke (if using), until smoothly combined.",
        "Season the pork all over with a generous amount of kosher salt and ground pepper.",
        "Add the pork to the slow cooker and spoon the sauce all over the top to cover it.",
        "Cover the slow cooker and cook on HIGH for 5 to 6 hours or LOW for 8 to 10 hours, until the pork is fall-apart tender. Transfer the pork to a large bowl, leaving the cooking liquid in the slow cooker.",
        "In a small bowl, stir together the cornstarch with 3 tablespoons cold water to create a slurry. Pour into the slow cooker, then whisk to combine. Cover the slow cooker and cook on HIGH, whisking every so often, until the sauce is thickened to your liking, about 20 to 30 minutes.",
        "While the sauce thickens, shred the pork with two forks or, if it is cool enough to handle, with your fingers.",
        "Stir the shredded pork back into the thickened sauce in the slow cooker. Taste and adjust seasoning as desired (you may need an extra pinch of salt or some additional hot sauce if you enjoy a kick). Spoon pork on top of buns with coleslaw and pickles to create a sandwich, or serve it any way you like."
      ],
      "notes": "Store slow cooker pulled pork for up to 4 days. Freeze for up to 3 months (sometimes longer). Let thaw overnight in the refrigerator.",
      "source": "Tammy's Recipe",
      "user id": ""

    },
    {
      "id": "6",
      "title": "Southern Sweet Potato Casserole",
      "category": "",
      "ingredients": [
        "1/2 cup unsalted butter softened",
        "3/4 cup light brown sugar",
        "1/2 cup whole milk",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1 teaspoon salt",
        "1/4 cup chopped pecans",
        "2 cups mini marshmallows",
        "1/4 cup chopped pecans"
      ],
      "instructions": [
        "Peel and cut the washed sweet potatoes into cubes.",
        "Add the cubed sweet potatoes to a large stockpot, and cover them with water. Bring to a boil on the stove over medium heat, and cook for 10 to 15 minutes, or until tender when poked with a fork.",
        "When the potatoes are fully cooked, drain the water and add the potatoes to a large mixing bowl.",
        "Mash the sweet potatoes with a potato masher or hand mixer, so they're ready to go into the casserole.",
        "Pre-heat your oven to 375° F, and lightly spray the sides and bottom of a 9×13 casserole dish with cooking spray.",
        "Add the softened butter, brown sugar, milk, eggs, vanilla extract, and salt to the sweet potatoes in the mixing bowl, and whisk until everything is well combined.",
        "Stir the chopped pecans into the sweet potato mixture.",
        "Evenly spread the mixture into the prepared baking dish.",
        "Sprinkle the top with marshmallows and the remaining pecans.",
        "Bake at 375° F for 25 to 30 minutes, or until the marshmallows are golden brown.",
        "Serve it immediately while warm, and store any leftovers in the fridge.",
        ""
      ],
      "notes": "You can store in the refigerator for up to 4-5 days.If you don't want to go through the process of boiling your sweet potatoes, you can go the easier route and just make Instant Pot sweet potatoes. Then peel them and mash them right in the pot with an immersion blender or hand mixer.",
      "source": "",
      "user id": ""

    },
    {
      "id": "",
      "title": "",
      "category": "",
      "ingredients": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      "instructions": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      "notes": "",
      "source": "",
      "user id": ""

    },
    {
      "id": "",
      "title": "",
      "category": "",
      "ingredients": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      "instructions": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      "notes": "",
      "source": "",
      "user id": ""

    }
]
  